{
  "id": "phase2-topic4",
  "slug": "troubleshooting-lab",
  "name": "Network Troubleshooting Lab",
  "description": "Put your networking knowledge to the test! Diagnose and fix connectivity issues in a broken environment using the tools you've learned.",
  "order": 4,
  "is_capstone": true,
  "learning_steps": [
    {
      "order": 1,
      "text": "Set Up the Lab Environment",
      "action": "Setup:",
      "title": "Create Your Troubleshooting Lab",
      "description": "Set up a local Docker environment with multiple containers that have intentional network misconfigurations. Follow the lab guide to create DNS issues, firewall blocks, and routing problems to diagnose."
    },
    {
      "order": 2,
      "text": "Diagnostic Tools Review",
      "action": "Review:",
      "title": "Your Troubleshooting Toolkit",
      "description": "Ensure you're comfortable with: ping (connectivity), traceroute (path), dig/nslookup (DNS), curl (HTTP), netstat/ss (ports), tcpdump (packets). Each tool reveals different information."
    },
    {
      "order": 3,
      "text": "Scenario 1: DNS Resolution Failure",
      "action": "Diagnose:",
      "title": "Why Can't I Resolve This Hostname?",
      "description": "A container can't reach a service by name. Use dig and nslookup to identify whether the issue is DNS configuration, missing records, or resolver problems."
    },
    {
      "order": 4,
      "text": "Scenario 2: Connection Refused",
      "action": "Diagnose:",
      "title": "Why Is the Connection Refused?",
      "description": "A service shows 'connection refused'. Determine if the service isn't running, is bound to the wrong interface, or if a firewall is blocking traffic."
    },
    {
      "order": 5,
      "text": "Scenario 3: Timeout Issues",
      "action": "Diagnose:",
      "title": "Why Is It Timing Out?",
      "description": "Requests to a service time out instead of failing fast. Use traceroute and tcpdump to identify where packets are being dropped or if there's a routing issue."
    },
    {
      "order": 6,
      "text": "Scenario 4: TLS/Certificate Errors",
      "action": "Diagnose:",
      "title": "Why Is the Certificate Invalid?",
      "description": "HTTPS requests fail with certificate errors. Use openssl s_client and curl -v to diagnose certificate chain issues, expiration, or hostname mismatches."
    },
    {
      "order": 7,
      "text": "Document Your Findings",
      "action": "Document:",
      "title": "Write Your Troubleshooting Report",
      "description": "For each issue: document the symptoms, the diagnostic commands you ran, what they revealed, and how you fixed the problem. This documentation skill is valuable in real incidents."
    },
    {
      "order": 8,
      "text": "Apply Fixes and Verify",
      "action": "Fix:",
      "title": "Resolve All Issues",
      "description": "Apply your fixes and verify each issue is resolved. Ensure all services can communicate as expected. Your troubleshooting report is your capstone deliverable."
    }
  ]
}
